/*
 Localized strings for CFErrors returned by AVFoundationCF.

 When displayed in an alert, the strings whose keys end in _Description will be the alert title.
 The strings whose keys end in _RecoverySuggestion or _FailureReason will be the alert body.
 */

"AVFoundationCFErrorDomain_AVCFErrorOutOfMemory_Description" = "Nie je možné dokončiť akciu";
"AVFoundationCFErrorDomain_AVCFErrorOutOfMemory_RecoverySuggestion" = "Skúste to znovu neskôr.";

"AVFoundationCFErrorDomain_AVCFErrorFileFormatNotRecognized_Description" = "Nie je možné otvoriť";
"AVFoundationCFErrorDomain_AVCFErrorFileFormatNotRecognized_FailureReason" = "Formát týchto médií nie je podporovaný.";
"AVFoundationCFErrorDomain_AVCFErrorFileFailedToParse_Description" = "Nie je možné otvoriť";
"AVFoundationCFErrorDomain_AVCFErrorFileFailedToParse_FailureReason" = "Tieto médiá sú zrejme poškodené.";

"AVFoundationCFErrorDomain_AVCFErrorContentIsProtected_Description" = "Nie je možné otvoriť";
"AVFoundationCFErrorDomain_AVCFErrorContentIsProtected_FailureReason" = "Táto aplikácia nie je autorizovaná na prehrávanie tohto súboru."; /* the file is DRM protected */
"AVFoundationCFErrorDomain_AVCFErrorNoImageAtTime_Description" = "Nie je možné otvoriť";
"AVFoundationCFErrorDomain_AVCFErrorNoImageAtTime_FailureReason" = "Tieto médiá nie je možné použiť.";
"AVFoundationCFErrorDomain_AVCFErrorDecoderTemporarilyUnavailable_Description" = "Nie je možné dekódovať";
"AVFoundationCFErrorDomain_AVCFErrorDecoderTemporarilyUnavailable_FailureReason" = "Dekodér vyžadovaný týmto médiom je zaneprázdnený.";
"AVFoundationCFErrorDomain_AVCFErrorDecoderTemporarilyUnavailable_RecoverySuggestion" = "Zastavte ostatné akcie, ktoré dekódujú médiá a skúste to znovu.";
"AVFoundationCFErrorDomain_AVCFErrorIncompatibleAsset_Description" = "Nie je možné otvoriť";
"AVFoundationCFErrorDomain_AVCFErrorIncompatibleAsset_FailureReason" = "Médiá nie je možné použiť na tomto počítači.";
"AVFoundationCFErrorDomain_AVCFErrorNoCompatibleAlternatesForExternalDisplay_Description" = "Nie je možné otvoriť";
"AVFoundationCFErrorDomain_AVCFErrorNoCompatibleAlternatesForExternalDisplay_FailureReason" = "Tento obsah nie je možné prehrať na externom displeji.";
"AVFoundationCFErrorDomain_AVCFErrorInsufficientContentProtectionConfiguration_Description" = "Nie je možné otvoriť";
"AVFoundationCFErrorDomain_AVCFErrorInsufficientContentProtectionConfiguration_FailureReason" = "V aktuálnej konfigurácii systému nie je možné prehrať chránený obsah.";
"AVFoundationCFErrorDomain_AVCFErrorTranscodeFrameMismatch_Description" = "Výstupné video po transkódovaní nemá správny počet snímok.";
"AVFoundationCFErrorDomain_AVCFErrorTranscodeFrameMismatch_FailureReason" = "Počet výstupných snímok po transkódovaní sa nerovná zdroju (nemá segmenty na upravovanie).";
"AVFoundationCFErrorDomain_AVCFErrorDecodeFailed_Description" = "Dekódovanie zlyhalo";
"AVFoundationCFErrorDomain_AVCFErrorDecodeFailed_FailureReason" = "dekódovač zaznamenal chybu";
"AVFoundationCFErrorDomain_AVCFErrorEncodeFailed_Description" = "Kódovanie zlyhalo";
"AVFoundationCFErrorDomain_AVCFErrorEncodeFailed_FailureReason" = "kódovač zaznamenal chybu";

